ERP DEV.WMS/src/DataProcessors/вмс_ЗагрузкаОстатковСкладаНаОпределеннуюЯчейку/вмс_ЗагрузкаОстатковСкладаНаОпределеннуюЯчейку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_ЗагрузкаОстатковСкладаНаОпределеннуюЯчейку</name>
</mdclass:DataProcessor>

ERP DEV.WMS/src/Enums/вмс_КачествоТовара/вмс_КачествоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_КачествоТовара</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Documents/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ОперацияПоЯчейкам</name>
  <registerRecords>InformationRegister.вмс_ИсторияИерархииКонтейнеров</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОстаткиВКонтейнерах</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ЗаданияКладовщикам</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОперацияПоЯчейкам</registerRecords>
  <registerRecords>InformationRegister.вмс_МестоположенияКонтейнеров</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Готов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактированиеИерархии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаСУпаковками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучныеИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСубОперации</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщику</name>
    <type>
      <types>DocumentRef.вмс_ЗаданиеКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <comment>Должен быть составной тип, чтобы вести серии, если типовые отключены</comment>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаТранзит</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПриемник</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриравнятьКоличество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <comment>Может хранить номер строки таблицы инвентаризации, чтобы ссылаться на нее в случае ошибки проведения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПересчетКонтейнераРодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоИнвентаризации</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИерархияКонтейнеров</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерРасход</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриход</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АгрегацияКонтейнеров</name>
    <comment>Используется для сборки\разборки товаров в контейнеры</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <comment>Хранит фактически отсканированную маркировку товара</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйКодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <comment>Партионный учет</comment>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/DataProcessors/вмс_ЗагрузкаОстатковСкладаНаОпределеннуюЯчейку/Forms/Форма/Module.bsl
//3.2.5
&НаКлиенте
Процедура ЗагрузитьОстатки(Команда)
	
	Если ЗначениеЗаполнено(Склад) И ЗначениеЗаполнено(ЯчейкаПриемник) Тогда
		ЗагрузитьОстаткиНаСервере(Склад, ЯчейкаПриемник);
	Иначе
		ПоказатьПредупреждение(,"Не выбран  склад или ячейка приемник!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОстаткиНаСервере(Склад, ЯчейкаПриемник)
	
	ТаблицаОстатковСклада = ПолучитьОстаткиПоВыбранномуСкладу(Склад);
	
	СоздатьОперациюПоЯчейкамДляРазмещенияОстатковНаЯчейку(ЯчейкаПриемник, ТаблицаОстатковСклада);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоВыбранномуСкладу(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	ТаблицаТоваровНаОстатках = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваровНаОстатках;
	
КонецФункции

&НаСервере
Процедура СоздатьОперациюПоЯчейкамДляРазмещенияОстатковНаЯчейку(ЯчейкаПриемник, ТаблицаОстатковСклада)
	
	ДокОбъект = Документы.вмс_ОперацияПоЯчейкам.СоздатьДокумент();
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	ДокОбъект.Готов = Истина;
	ДокОбъект.ВремяНачалаОперации = ТекущаяДатаСеанса();
	
	Для каждого СтрокаИсточник Из ТаблицаОстатковСклада Цикл
		
		СтрокаПриемник = ДокОбъект.Товары.Добавить();
		СтрокаПриемник.Товар = СтрокаИсточник.Номенклатура;
		СтрокаПриемник.ЯчейкаПриемник = ЯчейкаПриемник;
		СтрокаПриемник.Качество = Перечисления.вмс_КачествоТовара.Новый;
		ЗаполнитьЗначенияСвойств(СтрокаПриемник,СтрокаИсточник);
		
	КонецЦикла;
	
	ДокОбъект.Комментарий = "" + ЯчейкаПриемник + " - загрузка остатков по складу на ячейку. Создан автоматически. Отвественный: " + Пользователи.АвторизованныйПользователь();
	
	ДокОбъект.ВремяОкончанияОперации = ТекущаяДатаСеанса();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Сообщить("Создан документ - " + ДокОбъект.Ссылка);
	
КонецПроцедуры

//3.2.5
